Catalogs/ДоговорыКредитовИДепозитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ДоговорыКредитовИДепозитов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроцентнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заемщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальняСуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЗайма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПогашения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбеспечения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалоговаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодатели</Name>
					<Comment>Залогодатели по договору</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поручители_Старый</Name>
					<Comment>Залогодатели по договору</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлановогоПогашенияКредита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиКредита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаПроцентов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГраффикПогашения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УплатаОсновногоДолга</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленныеПроценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокОсновногоДолга</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Залог</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Залогодатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДоговораЗалога</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоговораЗалога</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИмуществаВЗалоге</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗалоговаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поручители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поручитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоговора</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрекращенияДоговора</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбеспечиваемыхОбязательств</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДоговорыКредитовИДепозитов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.ПорядокПогашения = "График" Тогда 
		Если Объект.ГраффикПогашения.Количество() > 0 Тогда 
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить("Очистить", "Очистить и заполнить");
			СписокКнопок.Добавить("Пересчитать","Пересчитать с учетом переплат");
			Ответ = Вопрос("Таблица выплат уже заполненная. Очистить таблицу и заполнить заново или пересчитать?", СписокКнопок);
			Если Ответ = "Очистить" Тогда 
				Объект.ГраффикПогашения.Очистить();
				ЗаполнитьПоГрафику();
			Иначе 
				ПерезаполнитьПографику();	
			КонецЕсли;
		Иначе 
			ЗаполнитьПоГрафику();	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоГрафику()
	ПроцентнаяСтавка = Объект.ПроцентнаяСтавка/100;
	
	КоличествоДней = (НачалоДня(Объект.ДатаПлановогоПогашенияКредита) - НачалоДня(Объект.ДатаВыдачиКредита))/86400;
	Если КоличествоДней > 0 Тогда 
		
		КоличествоДнейВПланируемомПериодеВыплаты = (НачалоДня(Объект.ДатаПлановогоПогашенияКредита) - НачалоДня(Объект.ДатаВыдачиКредита))/86400;
		//Рассчитываем периоды
		//Получаем 07 число следующего месяца
		Если Месяц(Объект.ДатаВыдачиКредита) = 12 Тогда
			ДатаПлатежа = Дата(Формат(Год(Объект.ДатаВыдачиКредита)+1,"ЧГ=0") + "01" +  "07")
		Иначе 
			ДатаПлатежа = Дата(формат( Год(Объект.ДатаВыдачиКредита),"ЧГ=0; ДФ=") + Формат(Месяц(Объект.ДатаВыдачиКредита) + 1,"ЧЦ=2; ЧВН=" ) + "07");
		КонецЕсли;
		
		//Оформляем первый платеж 		
		Если ((ДатаПлатежа - Объект.ДатаВыдачиКредита)/86400) < 14 Тогда
			ДатаПлатежа = ДобавитьМесяц(ДатаПлатежа,1);                 			
		КонецЕсли;
		
		//Рассчитываем количество платежей и их даты
		Строка = Объект.ГраффикПогашения.Добавить();
		Строка.Дата = ДатаПлатежа;
		КоличествоДней = (ДатаПлатежа - Объект.ДатаВыдачиКредита)/86400;
		Строка.КоличествоДней = КоличествоДней;
		Строка.УплатаОсновногоДолга = Объект.ПервоначальняСуммаЗадолженности/КоличествоДнейВПланируемомПериодеВыплаты*Строка.КоличествоДней;
		Строка.НачисленныеПроценты  = ПолучитьНачисленныеПроценты(Объект.ПервоначальняСуммаЗадолженности, Объект.ПроцентнаяСтавка, Объект.ДатаВыдачиКредита, ДатаПлатежа,  (НачалоДня(ДатаПлатежа)- НачалоДня(Объект.ДатаВыдачиКредита))/86400);
		Строка.ОстатокОсновногоДолга= Объект.ПервоначальняСуммаЗадолженности - Строка.УплатаОсновногоДолга;
		Строка.СуммаПлатежа = Строка.УплатаОсновногоДолга + Строка.НачисленныеПроценты;
		Остаток = Строка.ОстатокОсновногоДолга;
		Пока ДатаПлатежа < Объект.ДатаПлановогоПогашенияКредита Цикл
			Строка = Объект.ГраффикПогашения.Добавить();
			Если (Объект.ДатаПлановогоПогашенияКредита - ДатаПлатежа)/86400 <= 45  Тогда 	
				ДатаСледующегоПлатежа = Объект.ДатаПлановогоПогашенияКредита;				
			Иначе
				ДатаСледующегоПлатежа = ДобавитьМесяц(ДатаПлатежа ,1);
			КонецЕсли;
			Строка.Дата = ДатаСледующегоПлатежа;
			Строка.КоличествоДней = (НачалоДня(ДатаСледующегоПлатежа) - НачалоДня(ДатаПлатежа))/86400;			
			Строка.УплатаОсновногоДолга = Объект.ПервоначальняСуммаЗадолженности/КоличествоДнейВПланируемомПериодеВыплаты*Строка.КоличествоДней; 
			Строка.НачисленныеПроценты	= ПолучитьНачисленныеПроценты(Остаток, Объект.ПроцентнаяСтавка, ДатаПлатежа, ДатаСледующегоПлатежа, Строка.КоличествоДней);
			ДатаПлатежа = ДатаСледующегоПлатежа;
			Строка.ОстатокОсновногоДолга = Остаток - Строка.УплатаОсновногоДолга;
			Строка.СуммаПлатежа = Строка.УплатаОсновногоДолга + Строка.НачисленныеПроценты;
			Остаток = Остаток - Строка.УплатаОсновногоДолга;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

Процедура ПерезаполнитьПографику()
	ПроцентнаяСтавка = Объект.ПроцентнаяСтавка/100;
	
	КоличествоДней = (НачалоДня(Объект.ДатаПлановогоПогашенияКредита) - НачалоДня(Объект.ДатаВыдачиКредита))/86400;
	Если КоличествоДней > 0 Тогда 
		
		КоличествоДнейВПланируемомПериодеВыплаты = (НачалоДня(Объект.ДатаПлановогоПогашенияКредита) - НачалоДня(Объект.ДатаВыдачиКредита))/86400;
		//Рассчитываем периоды
		//Получаем 07 число следующего месяца
		Если Месяц(Объект.ДатаВыдачиКредита) = 12 Тогда
			ДатаПлатежа = Дата(Формат(Год(Объект.ДатаВыдачиКредита)+1,"ЧГ=0") + "01" +  "07")
		Иначе 
			ДатаПлатежа = Дата(формат( Год(Объект.ДатаВыдачиКредита),"ЧГ=0; ДФ=") + Формат(Месяц(Объект.ДатаВыдачиКредита) + 1,"ЧЦ=2; ЧВН=" ) + "07");
		КонецЕсли;
		
		//Оформляем первый платеж 		
		Если ((ДатаПлатежа - Объект.ДатаВыдачиКредита)/86400) < 14 Тогда
			ДатаПлатежа = ДобавитьМесяц(ДатаПлатежа,1);                 			
		КонецЕсли;
		
		Индекс = 0;
		КоличествоСтрок = Объект.ГраффикПогашения.Количество();
		//Рассчитываем количество платежей и их даты
		Строка = Объект.ГраффикПогашения[0];
		//Строка.Дата = ДатаПлатежа;
		ДатаПлатежа = Строка.Дата;
		КоличествоДней = (ДатаПлатежа - Объект.ДатаВыдачиКредита)/86400;
		Строка.КоличествоДней = КоличествоДней;
		УплатаОсновногоДолга = Объект.ПервоначальняСуммаЗадолженности/КоличествоДнейВПланируемомПериодеВыплаты*Строка.КоличествоДней;
		
		//Если УплатаОсновногоДолга >= Строка.УплатаОсновногоДолга Тогда
			//Строка.УплатаОсновногоДолга = Объект.ПервоначальняСуммаЗадолженности/КоличествоДнейВПланируемомПериодеВыплаты*Строка.КоличествоДней;
		//КонецЕсли;

		Строка.НачисленныеПроценты  = ПолучитьНачисленныеПроценты(Объект.ПервоначальняСуммаЗадолженности, Объект.ПроцентнаяСтавка, Объект.ДатаВыдачиКредита, ДатаПлатежа,  (НачалоДня(ДатаПлатежа)- НачалоДня(Объект.ДатаВыдачиКредита))/86400);
		
		Строка.ОстатокОсновногоДолга= Объект.ПервоначальняСуммаЗадолженности - Строка.УплатаОсновногоДолга;
		Строка.СуммаПлатежа = Строка.УплатаОсновногоДолга + Строка.НачисленныеПроценты;
		Остаток = Строка.ОстатокОсновногоДолга;
		индекс = 1;
		Пока индекс < КоличествоСтрок Цикл
			Строка = Объект.ГраффикПогашения[Индекс];
			Если (Объект.ДатаПлановогоПогашенияКредита - ДатаПлатежа)/86400 <= 45  Тогда 	
				ДатаСледующегоПлатежа = Объект.ДатаПлановогоПогашенияКредита;				
			Иначе
				ДатаСледующегоПлатежа = ДобавитьМесяц(ДатаПлатежа ,1);
			КонецЕсли;
			//Строка.Дата = ДатаСледующегоПлатежа;
						
			ДатаСледующегоПлатежа = Строка.Дата;
			Строка.КоличествоДней = (НачалоДня(ДатаСледующегоПлатежа) - НачалоДня(ДатаПлатежа))/86400;			
			УплатаОсновногоДолга = Объект.ПервоначальняСуммаЗадолженности/КоличествоДнейВПланируемомПериодеВыплаты*Строка.КоличествоДней;
			Если УплатаОсновногоДолга > Остаток Тогда 
				Строка.УплатаОсновногоДолга = Остаток;
			ИначеЕсли УплатаОсновногоДолга >= Строка.УплатаОсновногоДолга Тогда 
			//	Строка.УплатаОсновногоДолга = УплатаОсновногоДолга;
			КонецЕсли; 			
			
			Строка.НачисленныеПроценты	= ПолучитьНачисленныеПроценты(Остаток, Объект.ПроцентнаяСтавка, ДатаПлатежа, ДатаСледующегоПлатежа, Строка.КоличествоДней);
			ДатаПлатежа = ДатаСледующегоПлатежа;
			Строка.ОстатокОсновногоДолга = Остаток - Строка.УплатаОсновногоДолга;
			Строка.СуммаПлатежа = Строка.УплатаОсновногоДолга + Строка.НачисленныеПроценты;
			Остаток = Остаток - Строка.УплатаОсновногоДолга;
			индекс = Индекс +1;
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьНачисленныеПроценты(Остаток, ПроцентнаяСтавка, ДатаНачала, ДатаОкончания, КоличествоДней)
	Если Месяц(ДатаОкончания) = 1 Тогда 
		Сумма1 =  Остаток * ПроцентнаяСтавка/100 / ПолучитьКоличествоДнейВГоду(ДатаНачала) * ((НачалоМесяца(ДатаОкончания)-1 - КонецДня(ДатаНачала))/84600)+1;	
		Сумма2 =  Остаток * ПроцентнаяСтавка/100 / ПолучитьКоличествоДнейВГоду(ДатаОкончания) *((ДатаОкончания - НачалоМесяца(ДатаОкончания))/84600 + 1); 
		Сумма = Сумма1 + Сумма2;
	Иначе 
		Сумма = Остаток * ПроцентнаяСтавка/100 / ПолучитьКоличествоДнейВГоду(ДатаНачала) * КоличествоДней;
	КонецЕсли;
	Возврат Сумма
КонецФункции

Функция ПолучитьКоличествоДнейВГоду(Дата)
	Возврат ДеньГода(КонецМесяца(ДобавитьМесяц(Дата,12 - Месяц(Дата))))	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ДатаВыдачиКредита = ТекущаяДата();
		Объект.ДатаПлановогоПогашенияКредита = ДобавитьМесяц(Объект.ДатаВыдачиКредита, 6);
		Объект.ПроцентнаяСтавка = 17;
	КонецЕсли;
	БюджетныйНаСервере.ДействияПриСозданииФормыСправочника(ЭтаФорма);
КонецПроцедуры
